c2f1413183766e104ce4b329feaad353/update/sys_soap_message_function_186a1dd2830ba6104ce4b329feaad388.xml

<?xml version="1.0" encoding="UTF-8"?><record_update table="sys_soap_message_function">
    <sys_soap_message_function action="INSERT_OR_UPDATE">
        <authentication_type/>
        <basic_auth_password/>
        <basic_auth_profile/>
        <basic_auth_user/>
        <certificate/>
        <enable_mutual_auth>false</enable_mutual_auth>
        <envelope><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inc="http://www.service-now.com/incident">
   <soapenv:Header/>
   <soapenv:Body>
      <inc:getKeys>
         <!--Optional:-->
         <active>${getKeys.active}</active>
         <!--Optional:-->
         <activity_due>${getKeys.activity_due}</activity_due>
         <!--Optional:-->
         <additional_assignee_list>${getKeys.additional_assignee_list}</additional_assignee_list>
         <!--Optional:-->
         <approval>${getKeys.approval}</approval>
         <!--Optional:-->
         <approval_history>${getKeys.approval_history}</approval_history>
         <!--Optional:-->
         <approval_set>${getKeys.approval_set}</approval_set>
         <!--Optional:-->
         <assigned_to>${getKeys.assigned_to}</assigned_to>
         <!--Optional:-->
         <assignment_group>${getKeys.assignment_group}</assignment_group>
         <!--Optional:-->
         <business_duration>${getKeys.business_duration}</business_duration>
         <!--Optional:-->
         <business_impact>${getKeys.business_impact}</business_impact>
         <!--Optional:-->
         <business_service>${getKeys.business_service}</business_service>
         <!--Optional:-->
         <business_stc>${getKeys.business_stc}</business_stc>
         <!--Optional:-->
         <calendar_duration>${getKeys.calendar_duration}</calendar_duration>
         <!--Optional:-->
         <calendar_stc>${getKeys.calendar_stc}</calendar_stc>
         <!--Optional:-->
         <caller_id>${getKeys.caller_id}</caller_id>
         <!--Optional:-->
         <category>${getKeys.category}</category>
         <!--Optional:-->
         <cause>${getKeys.cause}</cause>
         <!--Optional:-->
         <caused_by>${getKeys.caused_by}</caused_by>
         <!--Optional:-->
         <child_incidents>${getKeys.child_incidents}</child_incidents>
         <!--Optional:-->
         <close_code>${getKeys.close_code}</close_code>
         <!--Optional:-->
         <close_notes>${getKeys.close_notes}</close_notes>
         <!--Optional:-->
         <closed_at>${getKeys.closed_at}</closed_at>
         <!--Optional:-->
         <closed_by>${getKeys.closed_by}</closed_by>
         <!--Optional:-->
         <cmdb_ci>${getKeys.cmdb_ci}</cmdb_ci>
         <!--Optional:-->
         <comments>${getKeys.comments}</comments>
         <!--Optional:-->
         <comments_and_work_notes>${getKeys.comments_and_work_notes}</comments_and_work_notes>
         <!--Optional:-->
         <company>${getKeys.company}</company>
         <!--Optional:-->
         <contact_type>${getKeys.contact_type}</contact_type>
         <!--Optional:-->
         <contract>${getKeys.contract}</contract>
         <!--Optional:-->
         <correlation_display>${getKeys.correlation_display}</correlation_display>
         <!--Optional:-->
         <correlation_id>${getKeys.correlation_id}</correlation_id>
         <!--Optional:-->
         <delivery_plan>${getKeys.delivery_plan}</delivery_plan>
         <!--Optional:-->
         <delivery_task>${getKeys.delivery_task}</delivery_task>
         <!--Optional:-->
         <description>${getKeys.description}</description>
         <!--Optional:-->
         <due_date>${getKeys.due_date}</due_date>
         <!--Optional:-->
         <escalation>${getKeys.escalation}</escalation>
         <!--Optional:-->
         <expected_start>${getKeys.expected_start}</expected_start>
         <!--Optional:-->
         <follow_up>${getKeys.follow_up}</follow_up>
         <!--Optional:-->
         <group_list>${getKeys.group_list}</group_list>
         <!--Optional:-->
         <hold_reason>${getKeys.hold_reason}</hold_reason>
         <!--Optional:-->
         <impact>${getKeys.impact}</impact>
         <!--Optional:-->
         <incident_state>${getKeys.incident_state}</incident_state>
         <!--Optional:-->
         <knowledge>${getKeys.knowledge}</knowledge>
         <!--Optional:-->
         <location>${getKeys.location}</location>
         <!--Optional:-->
         <made_sla>${getKeys.made_sla}</made_sla>
         <!--Optional:-->
         <notify>${getKeys.notify}</notify>
         <!--Optional:-->
         <number>${getKeys.number}</number>
         <!--Optional:-->
         <opened_at>${getKeys.opened_at}</opened_at>
         <!--Optional:-->
         <opened_by>${getKeys.opened_by}</opened_by>
         <!--Optional:-->
         <order>${getKeys.order}</order>
         <!--Optional:-->
         <origin_id>${getKeys.origin_id}</origin_id>
         <!--Optional:-->
         <origin_table>${getKeys.origin_table}</origin_table>
         <!--Optional:-->
         <parent>${getKeys.parent}</parent>
         <!--Optional:-->
         <parent_incident>${getKeys.parent_incident}</parent_incident>
         <!--Optional:-->
         <priority>${getKeys.priority}</priority>
         <!--Optional:-->
         <problem_id>${getKeys.problem_id}</problem_id>
         <!--Optional:-->
         <reassignment_count>${getKeys.reassignment_count}</reassignment_count>
         <!--Optional:-->
         <reopen_count>${getKeys.reopen_count}</reopen_count>
         <!--Optional:-->
         <reopened_by>${getKeys.reopened_by}</reopened_by>
         <!--Optional:-->
         <reopened_time>${getKeys.reopened_time}</reopened_time>
         <!--Optional:-->
         <resolved_at>${getKeys.resolved_at}</resolved_at>
         <!--Optional:-->
         <resolved_by>${getKeys.resolved_by}</resolved_by>
         <!--Optional:-->
         <rfc>${getKeys.rfc}</rfc>
         <!--Optional:-->
         <route_reason>${getKeys.route_reason}</route_reason>
         <!--Optional:-->
         <service_offering>${getKeys.service_offering}</service_offering>
         <!--Optional:-->
         <severity>${getKeys.severity}</severity>
         <!--Optional:-->
         <short_description>${getKeys.short_description}</short_description>
         <!--Optional:-->
         <sla_due>${getKeys.sla_due}</sla_due>
         <!--Optional:-->
         <state>${getKeys.state}</state>
         <!--Optional:-->
         <subcategory>${getKeys.subcategory}</subcategory>
         <!--Optional:-->
         <sys_class_name>${getKeys.sys_class_name}</sys_class_name>
         <!--Optional:-->
         <sys_created_by>${getKeys.sys_created_by}</sys_created_by>
         <!--Optional:-->
         <sys_created_on>${getKeys.sys_created_on}</sys_created_on>
         <!--Optional:-->
         <sys_domain>${getKeys.sys_domain}</sys_domain>
         <!--Optional:-->
         <sys_domain_path>${getKeys.sys_domain_path}</sys_domain_path>
         <!--Optional:-->
         <sys_mod_count>${getKeys.sys_mod_count}</sys_mod_count>
         <!--Optional:-->
         <sys_updated_by>${getKeys.sys_updated_by}</sys_updated_by>
         <!--Optional:-->
         <sys_updated_on>${getKeys.sys_updated_on}</sys_updated_on>
         <!--Optional:-->
         <task_effective_number>${getKeys.task_effective_number}</task_effective_number>
         <!--Optional:-->
         <time_worked>${getKeys.time_worked}</time_worked>
         <!--Optional:-->
         <universal_request>${getKeys.universal_request}</universal_request>
         <!--Optional:-->
         <upon_approval>${getKeys.upon_approval}</upon_approval>
         <!--Optional:-->
         <upon_reject>${getKeys.upon_reject}</upon_reject>
         <!--Optional:-->
         <urgency>${getKeys.urgency}</urgency>
         <!--Optional:-->
         <user_input>${getKeys.user_input}</user_input>
         <!--Optional:-->
         <watch_list>${getKeys.watch_list}</watch_list>
         <!--Optional:-->
         <work_end>${getKeys.work_end}</work_end>
         <!--Optional:-->
         <work_notes>${getKeys.work_notes}</work_notes>
         <!--Optional:-->
         <work_notes_list>${getKeys.work_notes_list}</work_notes_list>
         <!--Optional:-->
         <work_start>${getKeys.work_start}</work_start>
         <!--Optional:-->
         <__use_view>${getKeys.__use_view}</__use_view>
         <!--Optional:-->
         <__encoded_query>${getKeys.__encoded_query}</__encoded_query>
         <!--Optional:-->
         <__limit>${getKeys.__limit}</__limit>
         <!--Optional:-->
         <__first_row>${getKeys.__first_row}</__first_row>
         <!--Optional:-->
         <__last_row>${getKeys.__last_row}</__last_row>
      </inc:getKeys>
   </soapenv:Body>
</soapenv:Envelope>]]></envelope>
        <function_name>getKeys</function_name>
        <key_store/>
        <key_store_alias/>
        <key_store_password/>
        <lock>false</lock>
        <protocol_profile/>
        <qualified_name>Incident Integration [ getKeys ]</qualified_name>
        <soap_action>http://www.service-now.com/incident/getKeys</soap_action>
        <soap_endpoint>https://dev272006.service-now.com/incident.do?SOAP</soap_endpoint>
        <soap_message display_value="Incident Integration">efa89952830ba6104ce4b329feaad3d0</soap_message>
        <strip_whitespace>false</strip_whitespace>
        <sys_class_name>sys_soap_message_function</sys_class_name>
        <sys_created_by>admin</sys_created_by>
        <sys_created_on>2025-08-01 06:19:33</sys_created_on>
        <sys_id>186a1dd2830ba6104ce4b329feaad388</sys_id>
        <sys_mod_count>0</sys_mod_count>
        <sys_name>getKeys</sys_name>
        <sys_package display_value="Right Prompt Travel App" source="x_1804233_right_pr">c2f1413183766e104ce4b329feaad353</sys_package>
        <sys_policy/>
        <sys_scope display_value="Right Prompt Travel App">c2f1413183766e104ce4b329feaad353</sys_scope>
        <sys_update_name>sys_soap_message_function_186a1dd2830ba6104ce4b329feaad388</sys_update_name>
        <sys_updated_by>admin</sys_updated_by>
        <sys_updated_on>2025-08-01 06:19:33</sys_updated_on>
        <use_basic_auth>false</use_basic_auth>
        <use_mid_server/>
        <use_ws_security>false</use_ws_security>
        <ws_security_type/>
        <ws_security_username_profile/>
        <ws_security_x509_profile/>
    </sys_soap_message_function>
</record_update>
